#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-stable/runs/run-ktXTJssBZEBW2S8G

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-stable]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_stable]
aws_iam_user.packer: Refreshing state... [id=packer_stable]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.stable]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_stable]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_stable]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_stable]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_stable]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_stable]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_stable]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_stable]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_stable]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_stable]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_stable]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_stable]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_stable]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_stable]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_stable]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_stable]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_stable]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_stable]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_stable]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_stable]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_stable]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_stable]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_stable]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-08911eae9abd84cf6]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_stable-20210121192700351400000002]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_stable-20201204205417237900000006]
aws_security_group.external_workers: Refreshing state... [id=sg-0101286a377e77349]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_stable-20201204205416966800000003]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0ae86ea746d175eef]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_stable]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_stable]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_stable-20201204205417226300000005]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_stable-20210121192700349000000001]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_stable-20210121192700353500000003]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_stable-20210121142052939600000001]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-02523067c19e4d4ba]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-06923f1c47108b9a0]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-07a88a5868e40dd45]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_stable-20201204205417038600000004]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_stable]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_stable-20201204205417404800000008]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_stable-20210128142934485800000004]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_stable-20210121142052962300000002]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_stable-20210128142934516900000005]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934468200000003]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_stable-20210128142934521000000006]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934236300000001]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_stable-20210128142934539400000007]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_stable]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0a0bd62efe297d67e]
aws_security_group.external_composer: Refreshing state... [id=sg-006abcb539c009c0c]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-01a0d77a44f22a40b]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-05bbb2a36d0766e8d]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934423800000002]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=1bf38e95-9b24-4495-a732-2ead00868a91]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0ca491f03889e64a6]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_stable-20210121142053428000000004]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_stable-20210121142053396000000003]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0504fafb159143d31]
aws_network_interface.composer_external: Refreshing state... [id=eni-0f0890d7291842f4e]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_stable-2020120420541783040000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_stable-2020120420541781800000000a]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_stable]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-04cdca8908908504f]
aws_network_interface.composer_internal: Refreshing state... [id=eni-0df7102235a986cee]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-0789bee2463abeaba]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-20381e6b-32f5-432b-a6a6-11942e09fa00]
aws_eip.lb: Refreshing state... [id=eipalloc-0db925336463825a2]
aws_instance.composer_external: Refreshing state... [id=i-04cd9b83ff5f23afe]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_stable-20201204205417690700000009]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-08f0a8a5c9c6547df]
aws_instance.composer_internal: Refreshing state... [id=i-0a948775c1cd42683]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-9d7588d7-3bbd-4199-89d6-989cd26ac6a6]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-175419074]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-1526492261]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-0a0bd62efe297d67e"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_stable"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ2XLjuHq+V9W8A+JxamaqQ4mLFstnPHVEidRKSuIq6iTlAkFIpAguJkFtPf0iucltHi+PkKIWt+zuWXOqUuObFoF/w4/v39DdJKY4poxxSPEjiApCgxRmtBYFe+z9DbhJEXswOzzdKUNFEqem2utozl2l/GIsnOVBEj8Crsp+U/mmwjC3RN9UrrJ7QZ4meUBPtJBSiPwIx/RvYBUQHMMIP90FcUCraLW++8xlZDDOVzhjpBglXhCvH0HLDegNwclkive0hkhSeAxK4lWw/qaiBBH+wrhvb2kqlSLHWf5YAYABpQWPACOeKRcrAACQ5/4zLKifZMERe88hPpxoyz8G3OW5z2Q5BJ1OpyMK6hF2uQPipfKz15l3xE6n0+3Mu/vNSh4OSX/VjdsBIoNDZGeSmBkmTyZNGup9g8Npy+vOjjtu4zTt2J+T2UJJ8SwL1L26IP0HZE/bNU1ORY89tuWdevgQrtZ+e1UcVKfeHn5QYHN6MCxx3fDVRN6vtEW/EQwoqulzEruSHIxTPayTIE3q8yUVabTuvKxDvdPsHf3D2m0WDaUd7I3hvm6Lm0JX2P5iflQ3KV4dArv4kA+1Dz5vZvNw3BGLYujM3WxDPsi+FcHJNtsejClf5FO6jR1x47uz3WHa4u3ZBqZjr9b2Dfgyk7idfGiaMh8vUH223rHrYO4288CVjWNLNfDeFhrz9sNLOp/aijNG6XqZER0OBuOlrvj0OG0p3jKbTmRzkehcB3cO9bVPkZpNRYO4DX07awnHI/siajKPutP6lN2ljd3uZeZvd3xMXSE1JjPqYTr6YDXY+SxO48VB1+Nlyh/lHcI85y72zVbst0nsT7LleoNbKJnHs468ryEiNCV9dFgHxQyJuw8h9+AUxFEW5gsUabgbTUJt00s3xoLHDWXENZNeKx8NUL1mN8LDarL1lNzyvReuuxj0LWuaHpO1y7YblhOw2kJO46VW47C17ta0D7Z1oM7KeWCzlTVFXifh+8tVPGocHc1cjEZtZRnCeL8XpJY5DUJppLZzc8Oz7LHZPRzY4Wr4YrgjTmysWitPgEjLJvUeckxPHtY48aDaTZnbtNAy6PSno7HqHhcyawh09bBnMTd/egIR3CTZ3zPs+ZBWURLdvcU79vhGg2ufMN89Y54se0NONaRGuTacidxGJvW0KRtisB8Yzd00bC4e4k1t2cLJTJ1LNYXdjesPjTFI3MKDwRtllV0WUPxcZoRLWKaQ+o+gRqP0HN7PZY543sIsP1mGzlngEfx8MXSqi+Zw0nvuThVlaDw9CAiuHlgWN/gGX3frXH3VWjXcVQNi1hNQm+PRQ5tr8xfu7lSZTXVJu7K3Vg0sND2vXX/gGuwKorrLCk2hiZqe0HbdVhPz+IHzVu+Vd567kmY8TXSWTnSuq5neyAjEnmaNTN1cjuasbGqnPZZ2Q26km5pkSWpvbi8XS1YWdHMkLllimT11rvDOUbXEvhk2OJdfsjhSGkYv5LW+b7q8JnqsptlmOnG5dAQHy40Ryppm7sZzIoseu3zRLEudh2QwN2RLM2XBY/eBwjbSpezliEt76mK5cW1V0Pv+xgi5l/nCm1mS1TQsbYlNTrIMdQH76tRYpKK3S8u9+pu9UF4Y1kjzWCu2Tc02LVnSJJn1IuWgb2TfEvzM6LMNbKXNOauKJksETZaXeki3dkgSL1Kn3ZPNo65pytKS92RTkqUTrd3uld/zUFbnsZjZluzolqo4R39i26lqWiTGsahNTVVUuNFEibyh1hP3zkI+epv12LFGGytUeJUojWXo7zXT3ENzb9nSg6D0RhreWEfIp4kipHtjQAbmxhdM4mwnvDpS7OEebUQLW6nhsHuocEiwrPQw3yWs2tMiR0iOxoLUXVltWpy1NDkxnodkAvueOB3IFJFUV+x25NjaAQ8s3ejSoxsuJd2mdUVAmXOUx0vLKpRIzRXZS7vEYu3eaKBxy55GPNXg5e0y1DJbtnpabE30gTc2ba9vDLSjLqnQttXII56tyylUw3rdY72dQmRoG8OGc/Q5dyG+KFZnbErL3JaU+rIvQ0PifFsmgWaIqr7QbEVSh3osChpLdk5MCtciptulRy22eLenba0+d8CDZIsXfhNJGm+F3AyF8sidp3WXzwVELGoNrFDrW7LJjboG74mKSTnH5HRrYPn6QtTc4yh0heV+fOzstcg5zs36wTJV0WMtcW7LU0vi+trCG5oWkbpkqStSuzsnRNbCRFgaS0cRwt2y386R3h47ZJk6IUk9XitMrpOpIdedSp6oWFaoLzzNNrmuY8p9feMRlayP2BBDl9+Nf4FXvPJqC0+eB23BNJfq3OS6c9upfz2u9q8Yna9TUYtTXuUJ0VnUcOV0gsLhwbA5CCV5r0tEwfbeNwRiIwMJ2pF0DWtkarG6s2OTVQZDQeM0wWG1xIvWnGaqW12Wg260zzxDdFSz7SxZjbcHahf12319MOIVic50e2+onDVWFs5O7edbnZDYHqDM7aemNVC200W6cze+bkV7igbmVmO5mWGYY9MeDcwuncKNBdHRijR2uYBSXTCMIWfa1Jr2RmN34BM9lHNz4Q/n/L5n9q26GaqqY8gNddERrH4jnvbEiU48FlvifDpPWZP31HncEVTL0pf2A6uaZt2U0oMed45wQLaqPKpPrZGm8fSAbVXXF140D30eCr6qR8sC8Ypg621etQmnbXyKJa7Z3aisEyaNMZs2NFPm9EGyd0KPQ6bqjAV5bFqa6XXbmnt0Dl7oLRwzbJjccuIQpe5YvjI/jqZqLG+gPdqjjVlfbjRJD+djPVZzQ38Q0EBtoI28VRca64SjQiUhN18o7W5wzsma2ZCGkiqbRBtpIenNLU0+53J2/L5SDKa68QR3eVnA0iTHWTXJ3SIgXjXJ1u+JO72eJun6E9fiqwJXbdarHHuhsafaWNKedX3yPJYc/bmjqU8wix/hLn/MMcowzSMYwzXOHoucwTCnDPfYFoRWg+farXa7faF6dDO8O/WqTEs2MSYX+bop6l1tODOGU/VZ6aid/qXMddTen1eWF26OsiAtu3rmwsKgJIpg7DHh3CFJ+6rf0Q1JOblL7SjS80yT5OHiKafQJZjBe4qzGBJml2Thpf2+8VtvqD3VMEW1i2+Zq7OvwqWuJhn667kktTebDlXj2dQmTz6laf5Yq709WPX1YFUYwWMSX+6wdtt2fE3lFwtVmkTk693IP8JkE/zH5QMSkuyw9+wlEQziHDyBf4A7imF0i5i7fwN3fuFWy1t8v372zZdb4KoBQfAE7r5uNYIMymg1xWWbdbHuLPAP2/dPs+Odp6MkDmiGvu7Kb4FSboPz6FZksIQcWCUZGEZwjYFYqsEZCGLQsfXqK1cvQfkjuGIgOuk43fPpV81LUFGOoSdx57WqTyNSeRXQ9TEKAd7i7AAEFuQYJbGXAxh7gCRrQBOQH3KSrK8qc0yBB3GUxEBgb9ZK4jPlZ9md0uUAIoTzHGwDWI6cgBZxjMlJMMaA+hhE15PnCcG3espjeSBNMgr4B44vjbrsln9FjgH0vKwUThIEiZ/k9GYfnrV7URA/nlR8NszCWbA6AOpDCnb4uwyDOKEAQxrE65LvbBaOkuwAkvj0FcQ5hTF6ta87kLrjS9iD+zLuX1UHqytvkZd39xNoNf71xrDyVhsAHRDB+c0y9XEM8B4jUCvyrHY6Us0N4lqaHJPMTegzJDi7OYUU50V2dmGWJPT00pAfcoojEOTxdxSsCkLe2isPJ9LF5hPLrGMMQO3W8jyFCL8a/sB+aTgNojd27wLqBzHg/hlHOqPxgo1gBXYYIBiDDEPkA+TF1c/j1OcYUKeG9H3kw4OH4x8egY3BLiAEQLKDhxysMQUQ1FkB+DjDwMUIlshJVgCRAMcUIJzR/K2byusEmY/JM/JiYA+NAbjUtndG3HpuBQOCbwGaBvH6TzjjV0WWsVCvC7dLWUITlJBzErjZyCmkRZnn6qzw7rpAnhOQnMpaDj6Cbqec54bysNsxpBIil4yV+XlUQ7B2Pi9T4LRMbODTnzrUay78zcN/mRz/5UTqwtx/vXQdxx448eQlXq5iqm/z6Xc5wPE2yJK4zIJgC7OgLMg5gBkG1+SIvRM0Hl9Z/3A6/VZSraE2VRVJNa5gnpuSKb2p0C8FLvC7cnzbddSCMtUz7jnVM9cjMTmF689QUiRd7/Slp7v/+a///G9wr0zVofFcztfGKT4vC7qkWcOuVGavy8oJ05BeP3sdQ7o+f2iSbk6Mp/vv4S4H+UsOchx7TITzUxZgmJPhTJERcP96KsBcCRg38Q7g7v5i2N0PF6kY+Qm4P8uuVLIiRpF3fvVAfpR44MP+d2DmTMq2WPZ9EWXAOdchSgCOy1sFDBMnu3M5+ZWX2j/y5rpnch8Tcm4Cf+nR9QadZdVicJGANEhxGb2VPCkyhL/+xFP5FvQxfVNewLBXrQxV3eioXel52Hu6/x6Vjmcm+QmWj7Ua12xX+Ua9evm3RiDFOa1FmELGgxTWrrKYwPuh1NHJcxyV/ikLZAwjXK3I5mTy2qw+3d1//Hr/+om5/3hjzKe7UtwsC2IKkuJseIx3N3JPd36nY3qqpJdidN0u4/T+4xvVn6onkfrFC+8YqpXrr/KSc0yZV1H3b8T8NW774pzzTOGWDnq9dZoAbaCenaHhdZBTnL3FxSltlzSVd0Fzitk3vX9Z8pjzErOFpMDg38t4YXDspUkQ03Mkf/y1qeLTheUiJfBK+t8YsT6Bn8HmBTAZuKvqJz6dZkG8vgM/nR1yO009X2x9vkxT1U2exJUr+69R3v1OYeBncLqkLALM6vcaUPnaxHf57xzAMLCgyV8Jaz2ckuQAynH5VBzOo01+xtlls0TZdXwB3c6pHQpWAYIUVysuzHGzDhgPMODHH38E9x/fPQJ/Aj+B+4+3k+ynmxnol9SE+HCaMN7o+v/C9VeeJn4TymdHnt4h3iL388bd1ynPsHx16pfeOzMwIT6cPPhOMMro/1Hw9Wpu4uKL0/z1IH5qDsrq8BWgl9WlSG9IKt8CY9qbvp0ZYoy9Mg+jJN7irKxHwamz7Kk6KEtsBnZlr7vDgMAiRn61giA9BcXdjacvY8KnW++XVerTHfjpp1sT/kIuvpbzIr34FeQ42wYIX/w7y3Ba9tPvH0O+y0GGo4Ti92yn2M8TFOJy8PqFNu4q7Szi8nL29/dufXxosewXzmSYbyr/GwAA//+CfBlf9R8AAA==" -> "H4sIAAAAAAAA/9RZ2XLjOHe+d9W8A+JxamaqQ4mLJFv+x1O/KJFaSUngJupPygWCkEgRXExCa0+/SG5ym8fLI6SoxS27e9b8VanxTYvA2XDOd87BQbfThJGEceY+I48gXlMWZihn1TjcEf9vwEvXiY/y/dOt1tcUeWzpnRZ0b2/KL84meRGmySMQKvw3N9/ccNw10Tc3F9mdsMjSImRHWsQYwkFMEvY3sAgpSVBMnm7DJGQVvFjefuYyc5QUC5JzSoJTP0yWj+DeC9kVwdFkRnasimm69jmcJotw+c2NFsbkC+O+vaa5uVkXJC8ebwDgQGnBIyBY5MrFGwAAKIrgGa1ZkObhgfjPEdkfacs/DtwWRcDlBQKtVqslS/oBtYU9FpXys9OatuRWq9VuTdu71ULt92l30U6aIaa9fezkipyblkhHDRYZXVMg2b3fnhy2wsptOEkwpZOZlpFJHuo7fUa7D9gZN6tQzWSfPzTVrb7/EC2WQXOx3uturdn/oKHGeG/a8rIe6Km6W8BZtx72GK4aU5p4ihoOMyOq0TBLa9M5k1m8bL0sI6PV6ByC/dJrrOtaM9yZ/V3NkVdrQ+O7s+lBX2VksQ+d9YeiDz8EopVPo2FLXq/77tTLV/SDGtgxGm3yzd4ci+tizDaJK68Cb7Ldj+9FZ7JC2dCvNgMTvUwUYavuG5YqJjNcmyy3/DKceo0i9FTzcK+bZOdI9Wnz4SWbjh3NHeJsOc+pgXq94dzQAnYY32v+PB+PVGuWGkKLtPa1ZcCwno9lk3p1YzO5lw4H/kWGqojb49qY32b17fZlEmy2YsI8KTNHE+YTNvhg1/npJMmS2d4wknkmHtQtJqLgzXaN+yRo0iQY5fPlitzjdJpMWuquiqnUUIzBfhmuJ1jefoiEB3dNXW1mvSCZRdvBKIKrTrYyZyKpawOhkXbui0EP16pOPdovRhtfK+zAfxHas17XtsfZIV16fLNuuyEPZ2qWzGFVIPayXYUfHHvP3IX7wOcLe4z9Vip254tkUD+40JoNBk1tHqFkt5OUe2scRspAbxbWSuT5Q6O93/P9Rf/F9AaCXF/cL3wJYZiPah3sWr7arwryXncaqrC6x/Ow1R0Phrp3mKm8KbHFw44nwvTpCcRoleZ/z4kfIFbBaXz7Fu/EF+t1oXnEfPuEeTrv9AXdVOrlWn8iCyuV1rKGasrhrmc2tuOoMXtIVtX5PUkn+lSpavx2WHuoD0HqrX0UvlF2s81DRp7LinBOywyx4BFUWZyd0vu5rBHPG5QXR8vwqQo8gp/Pho4N2eqPOs/tsab1zacHCaPFA8+TulgXa15NqC3uF3VvUUeE9yXcFET80BSa4pm7PdYmY0OBF/b7RZ1IDd9v1h6EOr9AuObxUkNq4IYvNT3vvkFE8iD4i/fKW89tBZpPI4NnI0NoQ8sfmKHcgfbAMqz5YMqrFjzu8awdCQPDgoqt6J2pM5/NeVUyrIE856ltdfSpJroH3Za7VlQXPHHOk1irm51IhN3A8kQo+zyEjpWNPCEboN58ZUYqhNZ2OKWq7PPzF2jb+jSivamp2tBSJZ/fhRpfz+aqX2Ah6+iz+cpzdMnoBiszEl6mM39iK3bDtOGcWIJim/oMdfWxOctkf5uVe7U3e5E6M+0B9Hk7cSzoWLaqQEXl/VjbGys1sKUgN7t8ndhZY8rrssVTCarq3IjYxolo6sf6uH20edC2LFWZi75qKapypHWanfJ7Gqn6NJFzx1Zdw9Y19xCMHCfTLZsmJJHh2NJlTRiMtNjvw468c2fqwV8th649WNmRJupUq8+jYActa4esne0oD5LWGUCysg9IzFJNynZmj/asVSBZ1N2MRH2gOf0dXsk2sTPT5XdIE7Bk29l+uk15vQNjV0oP5ozWPFVv2II9twQ5mUZ0hLq+PO6pDNPM0Jxm7DpwT3q2YbbZwYvmiuGwmibh3D2ow7ltr7VYLzTVz9rU5p3OoAeFeQdSXzdFdTOPYO6odgcm9sjo+UPL8btmDx4MRUeOo8c+9R1DzZAe1Wo+7281qiLH7NfdQyB4M/lFs1tDS5kXjqLV5l0VmYoQOCoNoSnrxgw6mqL3jUSWIE+3bkLXnk0tr80OMLFFrwM3dlfYk166IbOggRUo2pEwwZE68KZZzRMLCVOb2T07gl1btYRB2xR9WbOY4FqCYffswJjJ0DsMIk+a74aH1g7G7mFq1fa2pcs+b8tTRx3bitCFM79v2VRp07mhKc32lFIVRqk0N+euJkXbebdZYKM5dOk8cyOa+SJcW0Ir1yOhPVZ8WbPtyJj50LGEtmupXWPlU50uD8SUI0/cDn+BV77wwpmvTsOmZFlzfWoJ7anj1r6eV7tXjE6XmQyTTNRFSg0e1z01G+GovzcdASFF3RkK1YizC0yJOtjEEjzQtmkPLJjoWyexeK3Xl6AAJZeHqR8vBWjpG0NVw3a8y31TdnWr6c55KDo9vY27za7RG4iawiaGszN1wR5qM3erd4uNQWni9HDudTPL7mmb8SzbeqvAsOMdwz1rA3lhYprW0HIGPavNxmhlI3ywY8jPZ0ipSabZFyyH2ePOYOj1AmpEamHNgv5U3HWsrl2zIl13TbWuz1qS3a0n4448MqjPE1uejqcZb4m+Pk1akm7bxtx54HXLqllKtjeS1gH16EZXB7WxPYBQZHvi6IYx8+NpFIhICnQjnq+xqEmO0RR1hwpwFTCiCI32SufdKK0P+awOLVUweunOjXwBW7o7lNShZUPLbzehd3D3fuTPXCuqW8J85FKt5tqBNj0MxnqirpAz2OGVVZuvoGJE06GR6IVpPEi4p9fxSt3oM8i70WCt00iYzrRmOzzVZGjVlb6iqxaFAxjRztSG6qmW88P3naI3NswnsmMkTxAtu1iWFiSvpIW3DqlfSfPlmcMZw6ECnw1j9DxUXOO5BfUnlCePaFs8FgTnhBUxStCS5I/rgiOoYJzw2JSk+7ooNO+bzeaZ6tHLyfZ4GeXuVYsQepZvWLLRhv2J2R/rz1pLb3XPfayld/68smLtFTgPs/Lazp1ZOJzGMUp8Lpq6NG1e9LuGqWhHf+gtTXmeQEXtz54KhjxKuIuHuG2aR+f79ZUXO334VCUMV89+4y6OvAhX2lAxjddzKXpnMu7r5rMFR08BY1nxWK2+PVjl9WAVFKNDmqBtUcanen2v+JrKLxYqLI3p168b/4jSVfgf5w9Eabol/rOfxihMCvAE/gFuGUHxNRpu/w3cBmuvUkbx/frJN19ugYsGjMATuP261RhxOGeVjJT3qLN1J4F/2L5/mh3vPB2nSchy/HVXfgu0chucZrN1jkrIgUWag36MlgTIpRqSgzABLceovHJ1Ulw8ggsG4qOOY5yPv6p+itflnHkUd1qrBCymN68C2gHBESAbku+BxIOC4DTxC4ASH9B0CVgKin1B0+VFZUEY8BGJ0wRI/NVaSXyi/Cy7VbocIIxJUYBNiMqZErB1khB6FEwIYAEB8eXkRUrJtZ7yWD7I0pwB8UEQS6POu+XfuiAA+X5eCqcpRjRIC3a1j07a/ThMHo8qPhtmkzxc7AELEANb8l1OQJIyQBALk2XJdzKLxGm+B2ly/AqTgqEEv9rX7int4TntwV2Z96+qw8WFd12UsfsJ3Nf/9cqwMqp1gPeYkuJqmQUkAWRHMKiui7x6PFLVC5Nqlh7S3EvZM6IkvzqFkhTr/OTCPE3Z8Smh2BeMxCAsku8YWKwpfWuv2h8pZ5uPLJOW2QPVa8uLDGHyavgD/6XhLIzf2L0NWRAmQPhnHOmExjM2wgXYEoBRAnKCcACwn1Q+z0ufc0Afm8r3cYD2Pkl+eAQOAduQUoDoFu0LsCQMIFDjJRCQnACPYFQiJ10ATEOSMIBJzoq3birDCfKA0GfsJ8Dpmz3Q6nSgYhjvjLj23AKFlFwDNAuT5Z9wxq+KLHOhVpOul/KUpTilpyJwtVEwxNZlnavx0rtwgaKgID22tQJ8BO1WObD11X67ZSolRM4VKw+KuIpR9XRebk2ysrCBT3/qUK+18DcP/2Vx/JcjqYeK4DXoBkl8cOQpSrxcxFTe1tPvCkCSTZinSVkFwQblYdmQC4ByAi7FkfhHaDy+sv7hcvqtott9ONY1RTcvYJ5aiqW86dAva7Im79rx9a2jGpalnvNOpZ67HIkrGFp+hpKmGEarqzzd/s9//ed/gzttrPfN53KANo/5eV4wFGj320pZvc4rR0wjdvnstEzl8r4BFcMamU9336NtAYqXAhQk8bmYFMcqwHFHw7l1TsHd66kAdyHgvNTfg9u7s2G3P5ylEhyk4O4k++YmXyc49k/PGjiIUx982P0OzJxI+Xuef99EOXCqdZhRQJIyqoDjknR7aie/8hT7Rx5Vd1wREEpPl8BfelW9QmfZtTiyTkEWZqTM3psiXeeYfP0N5+Zb0CXsTXsB/U7lpq8bZktvK8/9ztPd97h0PDcqjrB8rFaFRrMi1muV879VihgpWDUmDHE+Yqh6kcWF/g+ljlZRkLj0T9kgExSTyo1qjUavl9Wn27uPX7+/fuLuPl4Z8+m2FDfJw4SBdH0yPCHbK7nHmN8ahB076bkZXbbLPL37+Eb1p8pRpHH2wjuGys3lVxnkgjDuVdTdGzF/jWifnXOaKbzSQa9RZymAPf3kDEiWYcFI/hYXx7Jd0ty8S5pjzr65+5ctjzstcRtE1wT8e5kvHEn8LA0Tdsrkj782VXw6s5ylhH5J/xsj1ifwM1i9AC4HtxXjyGewPEyWt+Cnk0Oup6nns63P52mqsirS5ObC/muUt79TGPgZHIOUx4Bb/F4Dbr428Z3/vwZwHFqz9K+EtQ7JaLoH5bh8bA6n0aY44ey8WaLsMr6Adut4HQoXIUaMVG48VJBGDXA+4MCPP/4I7j6+e+X9BH4Cdx+vJ9lPVzPQL6mJyP44YbzR9f+F6688TfwmlE+OPL5DvEXu543br1OeYPnq1C+9d2LgIrI/evCdYJyz/6PgS2iu8uKL0/yFIH7pNevsjG5QkHwTYnJG+SQnWXnZez+pf1eAnMQpI+/ZjsAsUhyRcir4hTvGRdpJxPlZ5+9XHi8706fHh3ue/8KZHPfNzf8GAAD//x/1rYtzHgAA"
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-08f0a8a5c9c6547df"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_stable"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ2XLjuHq+V9W8A+JxamaqQ4mLFstnPHVEidRKSuIq6iTlAkFIpAguJkFtPf0iucltHi+PkKIWt+zuWXOqUuObFoF/w4/v39DdJKY4poxxSPEjiApCgxRmtBYFe+z9DbhJEXswOzzdKUNFEqem2utozl2l/GIsnOVBEj8Crsp+U/mmwjC3RN9UrrJ7QZ4meUBPtJBSiPwIx/RvYBUQHMMIP90FcUCraLW++8xlZDDOVzhjpBglXhCvH0HLDegNwclkive0hkhSeAxK4lWw/qaiBBH+wrhvb2kqlSLHWf5YAYABpQWPACOeKRcrAACQ5/4zLKifZMERe88hPpxoyz8G3OW5z2Q5BJ1OpyMK6hF2uQPipfKz15l3xE6n0+3Mu/vNSh4OSX/VjdsBIoNDZGeSmBkmTyZNGup9g8Npy+vOjjtu4zTt2J+T2UJJ8SwL1L26IP0HZE/bNU1ORY89tuWdevgQrtZ+e1UcVKfeHn5QYHN6MCxx3fDVRN6vtEW/EQwoqulzEruSHIxTPayTIE3q8yUVabTuvKxDvdPsHf3D2m0WDaUd7I3hvm6Lm0JX2P5iflQ3KV4dArv4kA+1Dz5vZvNw3BGLYujM3WxDPsi+FcHJNtsejClf5FO6jR1x47uz3WHa4u3ZBqZjr9b2Dfgyk7idfGiaMh8vUH223rHrYO4288CVjWNLNfDeFhrz9sNLOp/aijNG6XqZER0OBuOlrvj0OG0p3jKbTmRzkehcB3cO9bVPkZpNRYO4DX07awnHI/siajKPutP6lN2ljd3uZeZvd3xMXSE1JjPqYTr6YDXY+SxO48VB1+Nlyh/lHcI85y72zVbst0nsT7LleoNbKJnHs468ryEiNCV9dFgHxQyJuw8h9+AUxFEW5gsUabgbTUJt00s3xoLHDWXENZNeKx8NUL1mN8LDarL1lNzyvReuuxj0LWuaHpO1y7YblhOw2kJO46VW47C17ta0D7Z1oM7KeWCzlTVFXifh+8tVPGocHc1cjEZtZRnCeL8XpJY5DUJppLZzc8Oz7LHZPRzY4Wr4YrgjTmysWitPgEjLJvUeckxPHtY48aDaTZnbtNAy6PSno7HqHhcyawh09bBnMTd/egIR3CTZ3zPs+ZBWURLdvcU79vhGg2ufMN89Y54se0NONaRGuTacidxGJvW0KRtisB8Yzd00bC4e4k1t2cLJTJ1LNYXdjesPjTFI3MKDwRtllV0WUPxcZoRLWKaQ+o+gRqP0HN7PZY543sIsP1mGzlngEfx8MXSqi+Zw0nvuThVlaDw9CAiuHlgWN/gGX3frXH3VWjXcVQNi1hNQm+PRQ5tr8xfu7lSZTXVJu7K3Vg0sND2vXX/gGuwKorrLCk2hiZqe0HbdVhPz+IHzVu+Vd567kmY8TXSWTnSuq5neyAjEnmaNTN1cjuasbGqnPZZ2Q26km5pkSWpvbi8XS1YWdHMkLllimT11rvDOUbXEvhk2OJdfsjhSGkYv5LW+b7q8JnqsptlmOnG5dAQHy40Ryppm7sZzIoseu3zRLEudh2QwN2RLM2XBY/eBwjbSpezliEt76mK5cW1V0Pv+xgi5l/nCm1mS1TQsbYlNTrIMdQH76tRYpKK3S8u9+pu9UF4Y1kjzWCu2Tc02LVnSJJn1IuWgb2TfEvzM6LMNbKXNOauKJksETZaXeki3dkgSL1Kn3ZPNo65pytKS92RTkqUTrd3uld/zUFbnsZjZluzolqo4R39i26lqWiTGsahNTVVUuNFEibyh1hP3zkI+epv12LFGGytUeJUojWXo7zXT3ENzb9nSg6D0RhreWEfIp4kipHtjQAbmxhdM4mwnvDpS7OEebUQLW6nhsHuocEiwrPQw3yWs2tMiR0iOxoLUXVltWpy1NDkxnodkAvueOB3IFJFUV+x25NjaAQ8s3ejSoxsuJd2mdUVAmXOUx0vLKpRIzRXZS7vEYu3eaKBxy55GPNXg5e0y1DJbtnpabE30gTc2ba9vDLSjLqnQttXII56tyylUw3rdY72dQmRoG8OGc/Q5dyG+KFZnbErL3JaU+rIvQ0PifFsmgWaIqr7QbEVSh3osChpLdk5MCtciptulRy22eLenba0+d8CDZIsXfhNJGm+F3AyF8sidp3WXzwVELGoNrFDrW7LJjboG74mKSTnH5HRrYPn6QtTc4yh0heV+fOzstcg5zs36wTJV0WMtcW7LU0vi+trCG5oWkbpkqStSuzsnRNbCRFgaS0cRwt2y386R3h47ZJk6IUk9XitMrpOpIdedSp6oWFaoLzzNNrmuY8p9feMRlayP2BBDl9+Nf4FXvPJqC0+eB23BNJfq3OS6c9upfz2u9q8Yna9TUYtTXuUJ0VnUcOV0gsLhwbA5CCV5r0tEwfbeNwRiIwMJ2pF0DWtkarG6s2OTVQZDQeM0wWG1xIvWnGaqW12Wg260zzxDdFSz7SxZjbcHahf12319MOIVic50e2+onDVWFs5O7edbnZDYHqDM7aemNVC200W6cze+bkV7igbmVmO5mWGYY9MeDcwuncKNBdHRijR2uYBSXTCMIWfa1Jr2RmN34BM9lHNz4Q/n/L5n9q26GaqqY8gNddERrH4jnvbEiU48FlvifDpPWZP31HncEVTL0pf2A6uaZt2U0oMed45wQLaqPKpPrZGm8fSAbVXXF140D30eCr6qR8sC8Ypg621etQmnbXyKJa7Z3aisEyaNMZs2NFPm9EGyd0KPQ6bqjAV5bFqa6XXbmnt0Dl7oLRwzbJjccuIQpe5YvjI/jqZqLG+gPdqjjVlfbjRJD+djPVZzQ38Q0EBtoI28VRca64SjQiUhN18o7W5wzsma2ZCGkiqbRBtpIenNLU0+53J2/L5SDKa68QR3eVnA0iTHWTXJ3SIgXjXJ1u+JO72eJun6E8dWBbbKPVQ59kJiT7WxpD3r+uR5LDn6c0dTn2AWP8Jd/phjlGGaRzCGa5w9FjmDYU4Z7rEtCK0Gz7Vb7Xb7QvXoZnh3alWZlmxiTC7ydVPUu9pwZgyn6rPSUTv9S5XrqL0/rywv3BxlQVo29cyFhUFJFMHYY8K5Q5L2Vb+jG5Jy8pbaUaTnmSbJw8VTTqFLMBPEFGcxJMwuycJL933jtt5Qe6phimoX1zJXX1+FS11NMvTXc0lqbzYdqsazqU2efErT/LFW26YIMyyC9Ta3YoWHhzZu1mGTaVG25W6bSfXtwauvB6+WjFUYwWMSX+65dtuafM2uLxaqNInI1zuWf4TJJviPywckJNlh79lLIhjEOXgC/wB3FMPoFlV3/wbu/MKtllf9fv3swC+3wFUDguAJ3H3dagQZlNFqistW7GLdWeAftu+fZsc7T0dJHNAMfd2V3wKl3Abn8a7IYIlLsEoyMIzgGgOxVIMzEMSgY+vVV65egvJHcAVKdNJxuufTr5qXoKIcVU/izmtVn0ak8iqg62MUArzF2QEILMgxSmIvBzD2AEnWgCYgP+QkWV9V5pgCD+IoiYHA3qyVxGfKz7I7pcsBRAjnOdgGsBxLAS3iGJOTYIwB9TGIrifPE4Jv9ZTH8kCaZBTwDxxfGnXZLf+KHAPoeVkpnCQIEj/J6c0+PGv3oiB+PKn4bJiFs2B1ANSHFOzwdxkGcUIBhjSI1yXf2SwcJdkBJPHpK4hzCmP0al93IHXHl9wA7svk8Ko6WF15i7y8u59Aq/GvN4aVt9oA6IAIzm+WqY9jgPcYgVqRZ7XTkWpuENfS5JhkbkKfIcHZzSmkOC+yswuzJKGn14j8kFMcgSCPv6NgVRDy1l55OJEuNp9YZh1jAGq3lucpRPjV8Af2S8NpEL2xexdQP4gB98840hmNF2wEK7DDAMEYZBgiHyAvrn4euT7HgDo1pO8jHx48HP/wCGwMdgEhAJIdPORgjSmAoM4KwMcZBi5GsEROsgKIBDimAOGM5m/dVF4nyHxMnpEXA3toDMCl/r0z4tZzKxgQfAvQNIjXf8IZvyqyjIV6XbhdyhKaoISck8DNRk4hLco8V2eFd9cF8pyA5FT7cvARdDvlzDeUh92OIZUQuWSszM+jGoK183mZAqdlYgOf/tShXnPhbx7+y+T4LydSF+b+66XrOPbAiScv8XIVU32bT7/LAY63QZbEZRYEW5gFZdXOAcwwuCZH7J2g8fjK+ofT6beSag21qapIqnEF89yUTOlNGX8pcPG+HN+2JrWgTPWMe071zPVITE7h+jOUFEnXO33p6e5//us//xvcK1N1aDyXM7hxis/Lgi5p1rArldnrsnLCNKTXz17HkK5PJJqkmxPj6f57uMtB/pKDHMceE+H8lAUY5mQ4U2QE3L+eCjBXAsZNvAO4u78YdvfDRSpGfgLuz7IrlayIUeSdX0aQHyUe+LD/HZg5k7Itln1fRBlwznWIEoDj8lYBw8TJ7lxOfuU194+8y+6Z3MeEnDvFX3qYvUFnWbUYXCQgDVJcRm8lT4oM4a8/A1W+BX1M35QXMOxVK0NVNzpqV3oe9p7uv0el45lJfoLlY63GNdtVvlGvXv6tEUhxTmsRppDxIIW1qywm8H4odXTyHEelf8oCGcMIVyuyOZm8drRPd/cfv97kfmLuP94Y8+muFDfLgpiCpDgbHuPdjdzTnd/pmJ4q6aUYXbfLOL3/+Eb1p+pJpH7xwjuGauX6q7zkHFPmVdT9GzF/jdu+OOc8eLilg15vnSZAG6hnZ2h4HeQUZ29xcUrbJU3lXdCcYvbNAFCWPOa8xGwhKTD49zJeGBx7aRLE9BzJH39t9Ph0YblICbyS/jfmsE/gZ7B5AUwG7qr6iU+nWRCv78BPZ4fcjlzPF1ufLyNXdZMnceXK/muUd79TGPgZnC4piwCz+r0GVL42Fl7+ywcwDCxo8lfCWg+nJDmAcqY+FYfzaJOfcXbZLFF2HV9At3Nqh4JVgCDF1YoLc9ysA8YDDPjxxx/B/cd3D8WfwE/g/uPtuPvpZgb6JTUhPpwmjDe6/r9w/ZX3i9+E8tmRp8eKt8j9vHH3dcozLF+d+qX3zgxMiA8nD74TjDL6fxR8vZqbuPjiNH89iJ+ag7I6fAXoZXUp0huSyrfAmPamb2eGGGOvzMMoibc4K+tRcOose6oOyhKbgV3Z6+4wILCIkV+tIEhPQXF34+nLmPDp1vtllfp0B3766daEv5CLr+W8SC9+BTnOtgHCF//OMpyW/fT7x5DvcpDhKKH4Pdsp9vMEhbgcvH6hjbtKO4u4PK/9/b1bHx9aLPuFMxnmm8r/BgAA///QkqUSGSAAAA==" -> "H4sIAAAAAAAA/9RZ2XLjOHe+V9W8A+JxamaqQ4mLFsv/eOoXJVIrKXEX9SflAkFIpAguJqG1p18kN7nN4+URUtTilt09a/6q1PimReAsHw4+nIOD7qYJxQllzEOGH0G8ITTMYE5rcbjH/t+Al24SH+aHpztlqEji1FJ7Hd29q5RfjI3zIkyTR8BV2W8q31QY5lbom8rVdi8ssrQI6UkWUgpREOOE/g0sQ4ITGOOnuzAJaRUtV3eftcwcJsUS54yUoNQPk9UjaHkhvRE4QaZ4T2uIpBufQWmyDFffVJQwxl+A+/ZWplLZFDgvHisAMKBE8Agw4plysAIAAEURPMMNDdI8PGL/OcKHk2z5x4C7ogiYvICg0+l0REE9wi53QLxUfvY6WkfsdDrdjtbdr5fycEj6y27SDhEZHGInl8TctHgyadLI6Jsczlp+d3bccWu36SSBRmZzJcOzPFT36pz0H5Azbdd0ORN99tiWd+rhQ7RcBe3l5qC69fbwgwKb04Npi6tGoKbyfqnP+41wQFHN0EjiSXI4zoyoTsIsrWsLKtJ41XlZRUan2TsGh5XX3DSUdrg3h/u6I643hsL259pRXWd4eQidzYdiqH8IeCvXonFH3GyGrubla/JBDuwYTrb59mBO+U0xpdvEFdeBN9sdpi3ema1hNvZr7cCELzOJ28mHpiXzyRzVZ6sduwo1r1mEnmweW6qJ947Q0NoPL5k2dRR3jLLVIicGHAzGC0MJ6HHaUvxFPp3I1jw1uA7uHOqrgCI1n4om8RrGdtYSjkf2RdRlHnWn9Sm7yxq73css2O74hHpCZk5m1Md09MFusNosyZL5wTCSRcYf5R3CPOfN981WErRJEkzyxWqNWyjVkllH3tcQEZqSMTqsws0MibsPEffgboirzK0XKNJoN5pE+rqXrc05jxvKiGumvVYxGqB6zWlEh+Vk6yuFHfgvXHc+6Nv2NDumK49tN2w3ZPW5nCULvcZhe9Wt6R8c+0DdpfvA5kt7ivxOyvcXy2TUOLq6NR+N2soigsl+L0gtaxpG0khtF9aaZ9ljs3s4sMPl8MX0RpzYWLaWvgCRnk/qPeRavjysceJBdZoyt26hRdjpT0dj1TvOZdYU6PJhz2JOe3oCMVyn+d9z7AeQVlEa373lO/b5RoNrnzjfPXOeLHpDTjWlRjk2nIncWib1rCmbYrgfmM3dNGrOH5J1bdHC6UzVpJrC7sb1h8YYpN7Gh+EbZ5VdHlL8XGaEy7HMIA0eQY3G2fl4P5c54nkL8+KEDJ2zwCP4+QJ0aojWcNJ77k4VZWg+PQgILh9YFjf4Bl/36lx92Vo2vGUDYtYXUJvj0UOba/MX7e5UmU0NSb+qt5YNLDR9v11/4BrsEqK6xwpNoYmavtD2vFYT8/iB85fvnXeeu5JuPk0Mlk4Mrqtb/sgMxZ5ujyzDWow0Vrb00xxLuxE3MixdsiW1pzmL+YKVBcMaiQuW2FZP1RTePaq22LeiBufxCxbHSsPsRbzeDyyP10Wf1XXHyiYel43gYLE2I1nXrd1YI7Los4sX3bZVLSIDzZRt3ZIFn92HCtvIFrJfIC7rqfPF2nNUwegHazPiXrS5P7Mlu2na+gJbnGSb6hz21ak5z0R/l5Vz9TdzkTw37ZHus3biWLpj2bKkSzLrx8rBWMuBLQS52Wcb2M6aGquKFksEXZYXRkS3TkRSP1an3RPmUdeyZGnB+7IlydJJ1mn3ym8tklUtEXPHll3DVhX3GEwcJ1MtmyQ4EfWppYoKN5oosT/Ue+LenctHf70au/ZobUcKrxKlsYiCvW5Ze2jtbUd6EJTeSMdr+wj5LFWEbG8OyMBaB4JF3O2EV0eKM9yjtWhjOzNddg8VDgm2nR20XcqqPT12hfRozkndk9WmzdkLixMTLSIT2PfF6UCmiGSG4rRj19EPeGAbZpcevWghGQ6tKwLK3aM8Xtj2RonVQpH9rEts1umNBjq36OnEV01e3i4iPXdku6cn9sQY+GPL8fvmQD8akgodR4194juGnEE1qtd91t8pRIaOOWy4x4Dz5uKLYnfGlrQoHEmpL/oyNCUucGQS6qaoGnPdUSR1aCSioLNk5yZk49nE8rr0qCc27/X0rd3nDniQbvE8aCJJ5+2Im6FIHnlaVvf4QkDEpvbAjvS+LVvcqGvyvqhYlHMtzrAHdmDMRd07jiJPWOzHx85ej92jZtUPtqWKPmuLmiNPbYnr63N/aNlE6pKFoUjtrkaIrEepsDAXriJEu0W/XSCjPXbJInMjkvm8vrG4Tq5GXHcq+aJi25Ex93XH4rquJfeNtU9UsjpiU4w8fjf+BV3xqqvPfVkL24JlLVTN4rqa49a/fq72rxzVVpmoJxmv8oQYLGp4cjZB0fBgOhyEkrw3JKJgZx+YAnGQiQT9SLqmPbL0RN05icUqg6Ggc7rgsnrqxytOt9StIcthN97nvim6qtV2F6zOOwO1i/rtvjEY8YpEZ4azN1XOHitzd6f2i61BSOIMUO71M8seKNvpPNt568Cw4z1FA2urs9zMNK2x5YwGVpdO4dqG6GjHOruYQ6kumOaQsxxqT3ujsTcIiBHJhTUPhhq/71l9u25FquqackOddwS730imPXFiEJ/FtqhNtYy1eF/Vko6g2raxcB5Y1bLqlpQdjKRzhAOyVeVRfWqPdJ2nB+yohjH3Yy0KeCgEqhEvNohXBMdo86pDOH0dUCxxze5aZd0obYzZrKFbMmcM0r0b+RyyVHcsyGPL1i2/29a9o3vwI3/uWlHD4hYTlyh11w4U7Tiaqom8hs5oj9ZWfbHWJSPSxkaiFqbxIKCB2kBreavOddaNRhuVRJw2V9rd8JyTdashDSVVtog+0iPS02xdPudydvy+UgymhvkUJhTnCSRlFcvSAufVtPA2IfGrab66aDhTfSzpz4YxeR5LrvHc0dUnmCePcFc8FhjlmBYxTOAK54+bgsGwoAz32BaEVoPn2q12u32RevRyvDtdRpmWbGFMLvYNSzS6+nBmDqfqs9JRO/1LHeuovT/vrNh4BcrDrLy2MxcVBqVxDBOfiTSXpO2rf9cwJeUUD7WjSM8zXZKH86eCQo9g5hohZpfm0eV+fRPF3lB/qmGKape4MddAXo1LXV0yjdd1SWpvNh2q5rOlT54CSrPisVbbZggzLIL1NrdkhYeHNm7WYZNpUbblbZtp9e3Cq68Lr5aKVRjDY5rAXVFuYu328vE1XF8MVGkak6/fSf4RpevwPy4fkJB0h/1nP41hmBTgCfwD3FEM41vK3P0buAs2XrXc6vfj5wB+OQWuHhAET+Du66gRZFBOqxkuL1sXdGeDfxjfPw3Hu0jHaRLSHH09lN8CpZwG5wZuk8OSl2CZ5mAYwxUGYukG5yBMQMcxqq9avRQVj+BKlPjk47TPp181P0Wbshk9mTuPVQMak8qrgW6AUQTwFucHILCgwChN/ALAxAckXQGaguJQkHR1dVlgCnyI4zQBAnszVgqfJT/b7pQhBxAhXBRgG8Ky8QR0kySYnAxjDGiAQXxdeZESfOunXJYPsjSngH/g+BLUZbb82xQYQN/PS+MkRZAEaUFv5uHZux+HyePJxWdgNs7D5QHQAFKww9/lGCQpBRjSMFmVemdYOE7zA0iT01eYFBQm6BVfdyB1x5fcAO7L5PDqOlxedTdFuXc/gVbjX2+AlbvaAOiACC5uhmmAE4D3GIHapshrpyXVvDCpZekxzb2UPkOC85tVSEmxyc8hzNOUnt4bikNBcQzCIvmOguWGkLd45eFEumA+qcw65gDUbpEXGUT4FfgD+yVwGsZvcO9CGoQJ4P4ZSzqz8cKNcAl2GCCYgBxDFADkJ9XPTdXnM6BOTen7OIAHHyc/PAIHg11ICIBkBw8FWGEKIKizAghwjoGHESyZky4BIiFOKEA4p8XbMJXbCfIAk2fkJ8AZmgPQ6fV0yTDegbiN3BKGBN8SNAuT1Z8Ixq+aLM9CvS7cDuUpTVFKzkngZqKgkG7KPFdnhXfbBYqCgPRU+wrwEXQ7ZVc3lIfdjimVFLlkrDwo4hqCtfN6mQ3OysQGPv2pRb3mwt9c/JfJ8V9Ooh4sgtdNN3Dig5NOUfLlaqb6Np9+VwCcbMM8TcosCLYwD8uqXQCYY3BNjtg/UePxVfUPp9NvJdUe6lNVkVTzSmbNkizpTRl/2eDN+3J8ezWphWWqZ7xzqmeuS2IKClefqaRIhtHpS093//Nf//nf4F6ZqkPzueyyzdP5vAwYkm4Pu1KZvS4jJ05Dev3sdUzp+giiS4Y1MZ/uv4e7AhQvBShw4jMxLk5ZgGFOwJlNTsD966oAcxVgvNQ/gLv7C7C7Hy5WMQpScH+2XankmwTF/vntAwVx6oMP+9/BmbMo22LZ90WUAedchygBOCl3FTBMku7O5eRX3mv/yMvrnikCTMj5pvhLT6837CyrFoM3KcjCDJent1Kkmxzhrz/0VL4FfUzflBcw7FUrQ9UwO2pXeh72nu6/R2XgmUlxouVjrcY121W+Ua9e/q0RSHFBazGmkPEhhbWrLSb0fyh9dIoCx2V8ygKZwBhXK7I1mbzeaJ/u7j9+/ZL7ibn/eAPm011pbpaHCQXp5gw8wbsbu6c9vzMwPVXSSzG6Tpfn9P7jG9efqieTxiUK7xSqleuvcpMLTJlXU/dvzPw1dvsSnHPj4ZUBet11mgJ9oJ6DoeNVWFCcv+XFKW2XMpV3h+Z0Zt80AGXJY85DzBaSDQb/Xp4XBid+loYJPZ/kj7/Weny6qFyshH4p/xt92CfwM1i/ACYHd1XjpGfQPExWd+Cnc0BuW67nC9bnS8tVXRdpUrmq/5rk3e80Bn4Gp03KY8Asfy+Aytfawst/6gCGgRua/pW41sMZSQ+g7KlPxeHc2hRnnl0mS5Zd2xfQ7ZyuQ+EyRJDiasWDBW7WAeMDBvz444/g/uO7p+BP4Cdw//G23f100wP9kpsIH04dxhtf/1+8/sr7xW9S+RzI02PFW+Z+nrj7uuSZlq9B/TJ6ZwUmwodTBN8ZRjn9Pxq+bs3NufhiNX8hil9rzSa7sBsUON+GCF9YPstxVl723nfq3xUgx3FK8Xu1EzGLFEW47Ap+4Y5xtXY2cXn7+ftNxMvK9OnxocWyXwSTYb6p/G8AAAD///LYXzSYHgAA"
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_security_group.external_composer will be updated in-place
  ~ resource "aws_security_group" "external_composer" {
        id                     = "sg-006abcb539c009c0c"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "173.174.129.23/32",
                  + "185.185.130.88/32",
                ]
              + description      = "ssh for mhayden and obudai"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "173.174.129.23/32",
                  - "185.185.130.88/32",
                ]
              - description      = "ssh for mhayden"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
            # (3 unchanged elements hidden)
        ]
        name                   = "external_composer_stable"
        tags                   = {
            "AppCode"      = "IMGB-001"
            "Name"         = "external_composer_stable"
            "ServiceOwner" = "Image Builder"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.external_workers will be updated in-place
  ~ resource "aws_security_group" "external_workers" {
        id                     = "sg-0101286a377e77349"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "173.174.129.23/32",
                  + "185.185.130.88/32",
                ]
              + description      = "ssh for mhayden and obudai"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "173.174.129.23/32",
                ]
              - description      = "ssh for mhayden"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
            # (1 unchanged element hidden)
        ]
        name                   = "external_workers_stable"
        tags                   = {
            "AppCode"      = "IMGB-001"
            "Name"         = "external_workers_stable"
            "ServiceOwner" = "Image Builder"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210128220427483500000001" -> (known after apply)
      ~ id                                  = "sfr-20381e6b-32f5-432b-a6a6-11942e09fa00" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - stable"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a0bd62efe297d67e" -> null
              - version = "2" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a0bd62efe297d67e"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210128220522717400000002" -> (known after apply)
      ~ id                                  = "sfr-9d7588d7-3bbd-4199-89d6-989cd26ac6a6" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - stable"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-08f0a8a5c9c6547df" -> null
              - version = "2" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-08f0a8a5c9c6547df"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 2 to add, 4 to change, 2 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*